Repository: saipy10/Fasal
Catalog: lib/l10n/app_*.arb
Languages: hi

# appTitle
source: Fasal
hi: फसल

source: Price Prediction
hi: मूल्य भविष्यवाणी

source: Crop Prediction
hi: फसल भविष्यवाणी

# govtSchemes
source: Government Schemes
hi: सरकारी योजनाएँ

# sixMonthForecast
source: 6-Month Forecast
hi: 6-महीने का पूर्वानुमान

source: Select State
hi: राज्य चुनें

source: Select Commodity
hi: फसल चुनें

# annualRainfall
source: Annual Rainfall (mm)
hi: वार्षिक वर्षा (मिमी)

source: Get Prediction
hi: भविष्यवाणी प्राप्त करें

source: Predicted Crop Price
hi: अनुमानित फसल मूल्य

# chooseState
source: Choose Select State
hi: राज्य चुनें

# chooseCommodity
source: Choose Select Commodity
hi: फसल चुनें

source: Please fill all fields
hi: कृपया सभी क्षेत्र भरें

# error
source: Error: {message}
hi: त्रुटि: {message}

# failedToConnect
source: Failed to connect to server: {error}
hi: सर्वर से कनेक्ट करने में विफल: {error}

source: Welcome, Farmer!
hi: स्वागत है, किसान!

# stayUpdated
source: Stay updated with the latest weather conditions and agricultural news.
hi: नवीनतम मौसम की स्थिति और कृषि समाचारों के साथ अपडेट रहें।

source: Latest Updates
hi: नवीनतम अपडेट

# noNewsAvailable
source: No news available at the moment.
hi: इस समय कोई समाचार उपलब्ध नहीं है।

# noUrlAvailable
source: No URL available for this article
hi: इस लेख के लिए कोई URL उपलब्ध नहीं है

# couldNotLaunch
source: Could not launch {url}
hi: {url} को लॉन्च नहीं किया जा सका

source: Details
hi: विवरण

source: Price Statistics
hi: मूल्य सांख्यिकी

source: Average Price
hi: औसत मूल्य

source: Minimum Price
hi: न्यूनतम मूल्य

source: Maximum Price
hi: अधिकतम मूल्य

source: Price Trend
hi: मूल्य प्रवृत्ति

source: Market Insights
hi: बाजार अंतर्दृष्टि

source: Price Change
hi: मूल्य परिवर्तन

source: Data Points
hi: डेटा बिंदु

source: Last Updated
hi: अंतिम अपडेट

source: Quick Analysis
hi: त्वरित विश्लेषण

# noHistoricalData
source: No historical data available for analysis.
hi: विश्लेषण के लिए कोई ऐतिहासिक डेटा उपलब्ध नहीं है।

# priceTrendAnalysis
source: The price trend shows a {movement} movement of {percentage}% over the recorded period.
hi: मूल्य प्रवृत्ति {movement} {percentage}% की गति दिखाती है जो रिकॉर्ड किए गए अवधि में है।

source: positive
hi: सकारात्मक

source: negative
hi: नकारात्मक

source: Launched
hi: लॉन्च किया गया

# couldNotLaunchWebsite
source: Could not launch website for {url}
hi: {url} के लिए वेबसाइट लॉन्च नहीं की जा सकी

# errorLaunchingWebsite
source: Error launching website: {error}
hi: वेबसाइट लॉन्च करने में त्रुटि: {error}

# nmeoOilseedsTitle
source: National Mission on Edible Oils - Oilseeds (NMEO-Oilseeds)
hi: राष्ट्रीय खाद्य तेल मिशन - तिलहन (एनएमईओ-तिलहन)

# nmeoOilseedsDescription
source: Aims to boost domestic oilseed production and achieve self-reliance in edible oils over {dateRange} with {budget}.
hi: {dateRange} तक घरेलू तिलहन उत्पादन को बढ़ावा देने और खाद्य तेलों में आत्मनिर्भरता हासिल करने का लक्ष्य, {budget} के साथ।

# pmRkvyTitle
source: Pradhan Mantri Rashtriya Krishi Vikas Yojana (PM-RKVY)
hi: प्रधानमंत्री राष्ट्रीय कृषि विकास योजना (पीएम-आरकेवीवाई)

# pmRkvyDescription
source: Promotes sustainable agriculture with {budget}, merging various schemes for flexibility.
hi: {budget} के साथ सतत कृषि को बढ़ावा देता है, लचीलेपन के लिए विभिन्न योजनाओं को एकीकृत करना।
